index.org
#+TITLE: IDE Tricks
#+AUTHOR: Sen Lin
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css"/>

* VS Code
** File
- Open file by filename: ~Command + P~
** Formatting code
- Auto indent lines: select the lines of code, press ~F1~, and then type ~Beaufity selection~
** Side by side editing
- Open file in a new side window: hold ~Command~ and click the file name in sidebar.
- Switch between editors: ~Command + 1~, ~Command + 2~
** Editing
- List and jump to a variable: ~Command + Shift + O~
- Go to definition of a variable: ~F12~
- Find all usages of a variable: ~Shift + F12~
- Rename a variable: ~F2~
* IntelliJ IDEA
* Git
** Commits
- Undo last commit: ~git reset --hard HEAD~1~
- Empty commit: ~git commit --allow-empty -m “Empty commit”~
** Transfer commits to another repo
- Generate patch file of the last commit: ~git diff HEAD~1 HEAD > filename.patch~
- Applying the patch in another repo: ~git apply filename.patch~
** Clean
- Remove everything except for these already in git (f: force removing; d: removing untracked directories in addition to untracked files; x: removing ignored files also): ~git clean -xfd~
- Remove ignored files while keeping just added (untracked) files: ~git clean -Xfd~ 
* Video and audio
- Extract audio from mp4 files: ~for vid in *.mp4; do ffmpeg -i "$vid" -vn -acodec libmp3lame "${vid%.mp4}.mp3"; done~

* Bash
** For each element in array
#+BEGIN_SRC bash
ids=(1111 2222 3333)
for id in "${ids[@]}"
do
  echo $id
done
#+END_SRC
